---
type: FluidType
namespace: Autodesk.Revit.DB.Plumbing
version: 2024
members: 11
tags: [revit-api, class]
---

# FluidType

`Autodesk.Revit.DB.Plumbing.FluidType` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddTemperature | 2013 | `public void AddTemperature ( FluidTemperature fluidTemperature )` |
| Method | ClearAllTemperatures | 2013 | `public void ClearAllTemperatures ()` |
| Method | Create | — | `` |
| Method | GetBasicIEnumerator | — | `internal virtual IEnumerator GetBasicIEnumerator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator < FluidTemperature > GetEnumerator ()` |
| Method | GetFluidTemperatureSetIterator | — | `public FluidTemperatureSetIterator GetFluidTemperatureSetIterator ()` |
| Method | GetFluidType | 2013 | `public static FluidType GetFluidType ( Document document , string fluidTypeName )` |
| Method | GetTemperature | 2013 | `public FluidTemperature GetTemperature ( double temperature )` |
| Method | IsFluidInUse | 2013 | `public static bool IsFluidInUse ( Document document , ElementId fluidId )` |
| Method | RemoveTemperature | 2013 | `public void RemoveTemperature ( double temperature )` |
| Property | Parameter | — | `` |